app/controllers/admin/registrations_controller.rb

SELECT * FROM "events" LIMIT 1
SELECT * FROM "registrations"
---
  def index
    @event = Event.first #for now there is only one event in the system
    @registrations = Registration.all

SELECT * FROM "registrations" WHERE ("registrations"."id" = E'1') LIMIT 1
DELETE FROM "registrations" WHERE ("id" IN (1))
---
  def delete
    if event = Registration.find_by_id(params[:id])
      event.delete