app/controllers/registrations_controller.rb

SELECT * FROM "events" LIMIT 1
SELECT * FROM "registrations"
SELECT count(*) AS count_all FROM "registrations"
---
  def index
    @event = Event.first #for now there is only one event in the system
    @registrations = Registration.all
    @remaining = 26 - Registration.count

SELECT count(*) AS count_all FROM "registrations"
---
  def new
    @registration = Registration.new
    @remaining = 26 - Registration.count

SELECT count(*) AS count_all FROM "registrations"
INSERT INTO "events" ("name", "start_date", "created_at", "updated_at", "time", "description", "end_date") VALUES(E'Rails woot!', NULL, '2010-01-10 12:42:37.092406', '2010-01-10 12:42:37.092406', NULL, NULL, NULL) RETURNING "id"
INSERT INTO "registrations" ("name", "comment", "created_at", "event_id", "updated_at", "os", "commitment_strength", "organisation", "email") VALUES(E'Breccan', E'There should be cake.', '2010-01-16 12:46:47.770871', 1, '2010-01-16 12:46:47.770871', E'ubuntu', NULL, E'3months', E'breccan@3months.com') RETURNING "id"
---
  def create
    @registration = Registration.new(params[:registration])
    @registration.event_id ||= 1 #TODO remove once there are more events, this won't break if I forget though.
    if Registration.count < 26
    if @registration.save