app/controllers/registrations_controller.rb

UPDATE "registrations" SET "updated_at" = '2010-01-10 12:41:00.613092', "event_id" = 1 WHERE "id" = 2
---
  def create
    @registration = Registration.create(params[:registration])
    @registration.event_id ||= 1 #TODO remove once there are more events, this won't break if I forget though.
    if @registration.save